org-source/ledger-typo-check-payees.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2021-10-24 日 16:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ledger &#x2014; 支払先のタイプミスをチェックする</title>
<meta name="author" content="YAMAGAMI" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content">
<h1 class="title">Ledger &#x2014; 支払先のタイプミスをチェックする</h1>

<div id="outline-container-org75f7f9a" class="outline-2">
<h2 id="org75f7f9a"><span class="section-number-2">1</span> </h2>
<div class="outline-text-2" id="text-1">
<p>
家計簿でも会社の帳簿でも、支払先の名前をタイプミスするとちょっと面倒なことが起こる。
会計ソフトにはそれへの対応策が含まれている？
</p>

<p>
Ledgerでも簡単で便利なツールが用意されています。
</p>

<p>
以前（2019/10/04）、
<a href="https://bred-in-bingo.netlify.app/posts/9th-step_ledger/#payees%E3%82%B3%E3%83%9E%E3%83%B3%E3%83%89">プレーンテキストファイルで「複式」家計簿(9)</a> 
で <code>payees</code> コマンドと <code>-by-payee (-P)</code> オプションについて簡単に紹介。
</p>
</div>

<div id="outline-container-orgff860ca" class="outline-3">
<h3 id="orgff860ca"><span class="section-number-3">1.1</span> 復習しておきます</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>payees</code> コマンドには大きく分けて2通りの使い方があります。
引数なしで起動すると <code>myledger.data</code> に含まれる全ての支払先名が表示されます。
</p>
<div class="org-src-container">
<pre class="src src-sh">  $ ledger payees -f myledger.data
ANA
APITA
ATM
AWS
Amazon
&#12288;&#65306;
</pre>
</div>
<p>
これに <code>--count</code> オプションを付けて起動すると、各支払先の先頭に出現頻度が表示されます<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。
</p>
<div class="org-src-container">
<pre class="src src-sh">    $<span style="color: #BA36A5;">ledger</span> payees --count -f myledger.dat
    12 ANA
     2 APITA
     108 ATM
     56 AWS
     282 Amazon
&#12288;&#12288;&#12288;&#65306;
</pre>
</div>
<p>
引数をつけて起動する方法もあります。たとえば、お酒(liquor)の購入先とその回数を知りたいときには次のようにします。
</p>
<div class="org-src-container">
<pre class="src src-sh">$ ledger payees liquor --count
60 Costco
1 KALDI
1 OK&#12473;&#12488;&#12450;
1 &#12414;&#12427;&#12365;&#12421;&#12358;
10 &#12420;&#12414;&#12420;
&#12288;&#12288;&#65306;
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org228cbf9" class="outline-2">
<h2 id="org228cbf9"><span class="section-number-2">2</span> さて本題</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>--check-payees</code> オプションは
Enable strict and pedantic checking for payees as well as accounts, commodities and tags.
</p>

<div class="org-src-container">
<pre class="src src-sh">$ led b --check-payees -f myledger.data
</pre>
</div>







<p>
ここでは、もう少し詳しく手順を説明します。
</p>
</div>
</div>





<div id="outline-container-org75078ae" class="outline-2">
<h2 id="org75078ae"><span class="section-number-2">3</span> Footnotes:</h2>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
この場合の頻度とはトランザクションの数ではなくて、トランザクション内に含まれるアカウントの数になっています。なので、たとえば<br />
2020/10/10 レストランHOGE<br />
　Expenses:Dinner         3,000 JPY<br />
　Expenses:Grocery:Liquor 1,200 JPY<br />
　visacard<br />
レストランHOGEで一度しか食事してない場合でも ~ledger payees &#x2013;count= すると、<br />
　3 レストランHOGE<br />
になります。
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">&#26085;&#20184;: 2021-12-31 金 00:00</p>
<p class="author">&#33879;&#32773;: YAMAGAMI</p>
<p class="date">Created: 2021-10-24 日 16:50</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
